tap "apple/apple", "http://github.com/apple/homebrew-apple"
tap "aws/tap"
tap "gromgit/fuse"
tap "homebrew/cask"
tap "homebrew/core"
tap "nikitabobko/tap"
brew "xz"
brew "automake"
brew "bash"
brew "bat"
brew "boost"
brew "btop"
brew "cairo"
brew "certifi"
brew "cmake"
brew "curl"
brew "djvulibre"
brew "libarchive"
brew "djvu2pdf"
brew "dust"
brew "eza"
brew "fd"
brew "gnutls"
brew "ffmpeg"
brew "gcc"
brew "open-mpi"
brew "fftw"
brew "fzf"
brew "geos"
brew "gh"
brew "git"
brew "git-gui"
brew "git-lfs"
brew "graphviz"
brew "pkgconf"
brew "guile"
brew "shared-mime-info"
brew "python@3.12"
brew "liblqr"
brew "libomp", link: true
brew "ipython"
brew "kondo"
brew "lapack"
brew "latexdiff"
brew "lazygit"
brew "libxc"
brew "llvm"
brew "mas"
brew "neovim"
brew "node"
brew "openblas"
brew "python-packaging"
brew "pstoedit"
brew "pyenv"
brew "python-tk@3.12"
brew "repomix"
brew "ripgrep"
brew "starship"
brew "tbb"
brew "tealdeer"
brew "texlive"
brew "tmux"
brew "tree"
brew "uv"
brew "virtualenv"
brew "wget"
brew "yt-dlp"
brew "zoxide"
brew "gromgit/fuse/sshfs-mac"
cask "ace-link"
cask "adobe-acrobat-reader"
cask "aerospace"
cask "aldente"
cask "anydesk"
cask "arc"
cask "authy"
cask "balenaetcher"
cask "betterdisplay"
cask "betterzip"
cask "blender"
cask "calibre"
cask "coconutbattery"
cask "cursor"
cask "deskpad"
cask "disk-drill"
cask "docker-desktop"
cask "font-caskaydia-cove-nerd-font"
cask "font-hack-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspice-nerd-font"
cask "gimp"
cask "glance-chamburr"
cask "hiddenbar"
cask "jan"
cask "keyclu"
cask "kiro"
cask "latest"
cask "libreoffice"
cask "maccy"
cask "macfuse"
cask "mattermost"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "microsoft-outlook"
cask "monitorcontrol"
cask "obsidian"
cask "openvpn-connect"
cask "paintbrush"
cask "pearcleaner"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "raindropio"
cask "raycast"
cask "sloth"
cask "soda-player"
cask "stats"
cask "sublime-merge"
cask "sublime-text"
cask "superwhisper"
cask "suspicious-package"
cask "syntax-highlight"
cask "texmaker"
cask "todoist-app"
cask "topnotch"
cask "transmission"
cask "vlc"
cask "xquartz"
cask "yandex"
cask "yandex-disk"
cask "zen"
mas "AdGuard for Safari", id: 1440147259
mas "Eye Monitor", id: 1527031341
mas "Grammarly for Safari", id: 1462114288
mas "Hush", id: 1544743900
mas "Instapaper", id: 288545208
mas "Keynote", id: 409183694
mas "LanguageTool", id: 1534275760
mas "LiquidText", id: 922765270
mas "Mendeley Web Importer", id: 1577516695
mas "Momentum", id: 1564329434
mas "Numbers", id: 409203825
mas "Obsidian Web Clipper", id: 6720708363
mas "OTP Manager", id: 928941247
mas "Pages", id: 409201541
mas "Pixea", id: 1507782672
mas "scite", id: 1551820111
mas "Slack", id: 803453959
mas "Super Agent", id: 1568262835
mas "Unsplash Wallpapers", id: 1284863847
mas "Xcode", id: 497799835
vscode "aaron-bond.better-comments"
vscode "alefragnani.project-manager"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "coderabbit.coderabbit-vscode"
vscode "donjayamanne.githistory"
vscode "dracula-theme.theme-dracula"
vscode "dzhavat.bracket-pair-toggler"
vscode "eamodio.gitlens"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "google.geminicodeassist"
vscode "gruntfuggly.todo-tree"
vscode "ionutvmi.path-autocomplete"
vscode "johnpapa.vscode-peacock"
vscode "kelvin.vscode-sshfs"
vscode "liviuschera.noctis"
vscode "mechatroner.rainbow-csv"
vscode "miguelsolorio.fluent-icons"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "naumovs.color-highlight"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "pmndrs.pmndrs"
vscode "pshershov.blueberry-banana"
vscode "ritwickdey.liveserver"
vscode "robbowen.synthwave-vscode"
vscode "saoudrizwan.claude-dev"
vscode "simonsiefke.svg-preview"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "thang-nm.catppuccin-perfect-icons"
vscode "tomoki1207.pdf"
vscode "usernamehw.errorlens"
vscode "vscode-icons-team.vscode-icons"
vscode "waderyan.gitblame"
vscode "whizkydee.material-palenight-theme"
vscode "yzhang.markdown-all-in-one"
